---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.PathShapeFailure
source: html/b5b7fdf0-8404-c8d7-a9d3-2b3c3315452e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.PathShapeFailure Property

Can't solve Rebar Shape in Path Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId PathShapeFailure { get; }
```